.config/doom/config.org
#+TITLE:    Emacs configuration
#+AUTHOR:   Jamie Findlay
#+LANGUAGE: en
#+OPTIONS:  toc:nil num:nil
#+STARTUP:  overview

This is my configuration for (Doom) Emacs. It is written using [[https://orgmode.org/][org mode]],
which allows for a literate programming style, with code blocks interleaved with
descriptive prose. (Doom handles the [[https://orgmode.org/manual/Extracting-Source-Code.html][tangling]], into /config.el/, via the =literate=
switch in /init.el/) This is solely intended for my own use, but feel free to copy
any hacks or solutions you happen to find useful!

* DOOM settings
** Setting the theme
I like the =nord= theme:
#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-nord)
#+END_SRC

=solarized= is also popular:
#+BEGIN_SRC emacs-lisp
;; (setq doom-theme 'solarized-dark)
#+END_SRC

This is the default theme:
#+BEGIN_SRC emacs-lisp
;; (setq doom-theme 'doom-one)
#+END_SRC

** Changing the image on the dashboard
This replaces the default DOOM logo with the standard Emacs one, located in =~/.config/doom/images=.
#+BEGIN_SRC emacs-lisp
(when (file-exists-p (concat doom-private-dir "images"))
  (setq +doom-dashboard-banner-padding '(0 . 2)
        fancy-splash-image (concat doom-private-dir "images/medium-emacs-logo.png")))
#+END_SRC

This replaces the DOOM ASCII banner, which appears when running Emacs in the terminal.
#+begin_src emacs-lisp
(defun minimal-banner-fn ()
  (let* ((banner '("██████╗"
                   "██╔═══██╗"
                   "██║██╗██║"
                   "██║██║██║"
                   "╚█║████╔╝"
                   "╚╝╚═══╝ "))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'minimal-banner-fn)
#+end_src

** Font settings
DOOM has three font settings (clearly more -- see unicode font variable below):
1. =doom-font=
2. =doom-variable-pitch-font=
3. =doom-big-font= -- used for =doom-big-font-mode=; use this for presentations or streaming.

Each of them takes a font-spec, font string ("Input Mono-12"), or xlfd font string.

I'm currently trying out
- +the Google font Inconsolata+ (it has no italic variant)
- JetBrains Mono
- +but might go back to InconsolataLGC, which has an italic variant.+ (nope -- this looks very fuzzy for whatever reason)
- Others to try:
  - Akkurat Mono?
  - Fire Code
TODO: use variable pitch font in Org mode? Need to find a better one ... ET
Book? Plantin? /Garamond??/
#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "JetBrainsMono NF" :size 14 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "Palatino Linotype" :size 16)
     doom-variable-pitch-font (font-spec :family "Source Sans Pro" :size 14)
               )
#+END_SRC

Setting a unicode font that has the right power line symbols for my terminal customisation.
#+begin_src emacs-lisp
(setq doom-unicode-font (font-spec :family "JetBrainsMono Nerd Font" :size 11))
#+end_src

* UI preferences
** Line numbers
Set default line number behaviour (=t=: absolute, =relative=: relative, =nil=: none).
#+begin_src emacs-lisp
(setq display-line-numbers-type t)
#+end_src

* Quality of life fixes
** Switch to the new window after splitting
By default, when the window is split the focus remains in the original window.
Usually I'm splitting because I want to do something new in a separate window,
so that isn't the behaviour I want.

#+begin_src emacs-lisp
(setq evil-split-window-below t
      evil-vsplit-window-right t)
#+end_src
** Enable mouse in terminal Emacs
#+begin_src emacs-lisp
(setq xterm-mouse-mode 1)
#+end_src

** Change undo behaviour
Undo by default considers anything taking place between entering insert mode and
leaving it as one edit operation, which means you can lose a whole paragraph
when you just want to undo a single word. This fixes that somewhat. The default
behaviour seems to be different on my Macbook, which is why I've kept this in an
OS-specific place. Need to investigate further. 20/9/21: this behaviour now also
seems to happen on Mac (perhaps after updating to Big Sur?), so I'm making it a
global change.
#+begin_src emacs-lisp
;; (when (eq system-type 'windows-nt)
  (setq evil-want-fine-undo t)
  ;; )
#+end_src

** Choose what files to hide when searching with ~counsel-locate~
This hides files starting with =#= or =.=, or ending with =#= or =~=.
#+begin_src emacs-lisp
(setq counsel-find-file-ignore-regexp
        (concat
         ;; File names beginning with # or .
         "\\(?:\\`[#.]\\)"
         ;; File names ending with # or ~
         "\\|\\(?:\\`.+?[#~]\\'\\)"))
#+end_src

** Allow Emacs to ask about potentially dangerous local variables
Sometimes it's useful to evaluate elisp code in local variables. The default
setting in Doom is to only allow ones previously identified as safe. This way
Emacs asks if it encounters something new. So this is still pretty safe --
things won't evaluate without my knowledge -- but it's a bit more flexible.
#+begin_src emacs-lisp
(setq enable-local-variables t)
#+end_src

** Start with auto-complete off
#+begin_src emacs-lisp
(after! company
  (setq company-idle-delay nil)
  )
#+end_src

** Change some keybindings
Add some more familiar keybindings:
- =C-s= saves
- =C-/= comments/uncomments
- (Ideally =C-z= would undo, but this is stubbornly set to =evil-emacs-state= ...)

 #+begin_src emacs-lisp
(when (eq system-type 'gnu/linux)
  (global-set-key "\C-s" 'save-buffer)
  (global-set-key [?\C-\/] 'evilnc-comment-or-uncomment-lines)
  ;; (global-set-key "\C-z" 'undo)
  )
 #+end_src

** Open =mailto= links with external program
Using ~open~ to run default mail app rather than Emacs.
#+begin_src emacs-lisp
(when (eq system-type 'gnu/linux)
  (setq browse-url-mailto-function 'browse-url-generic)
  (setq browse-url-generic-program "open")
  )
#+end_src
** Opening external files
Set external apps to open some files.
#+begin_src emacs-lisp
(use-package! openwith
  :after-call pre-command-hook
  :config
  (openwith-mode t)
  (setq openwith-associations
        (list
         (list (openwith-make-extension-regexp
                '("doc" "docx" "xls" "xlsx" "ppt" "odt" "ods" "odg" "odp"))
               "libreoffice"
               '(file))
         (list (openwith-make-extension-regexp
                '("pdf" "ps" "ps.gz" "dvi"))
               "evince"
               '(file))
         ))
  )
#+end_src

Settings for opening links in Org files.
#+begin_src emacs-lisp
(setq org-file-apps
 '((auto-mode . emacs)
   (directory . emacs)
   ("\\.mm\\'" . default)
   ("\\.x?html?\\'" . default)
   ("\\.docx?\\'" . "libreoffice %s")
   ("\\.xlsx?\\'" . "libreoffice %s")
   ("\\.pdf\\'" . default)
   )
 )
#+end_src

* Projectile
Stop projectile auto-detecting projects and filling the project list with random
folders.
#+begin_src emacs-lisp
(setq projectile-track-known-projects-automatically nil)
#+end_src

* LaTeX
** Stop flycheck mode operating in LaTeX modes
Apparently a lot of how I write LaTeX upsets =flycheck=, so I just end up with a
bunch of irrelevant error messages. This disables it.
#+begin_src emacs-lisp
(setq flycheck-global-modes '(not LaTeX-mode latex-mode))
#+end_src

** Turn off ~rainbow-delimiters~
It seems to bug out every so often and highlight /every/ parenthesis going ...
#+begin_src emacs-lisp
(after! tex
  (remove-hook 'TeX-update-style-hook #'rainbow-delimiters-mode))
#+end_src

** Start new LaTeX documents from templates
Directory where we can find the templates.
#+begin_src emacs-lisp
(setq latex-templates-directory "~/Dropbox/git/latex-templates/templates/")
#+end_src

List of templates with keys for the ~new-latex~ function. Also abstract? 'research proposal' (from =latex-templates= folder)?
#+begin_src emacs-lisp
(setq latex-templates-list '(("Article" . "article-template.tex")
                             ("Tufte-style handout" . "tufte-handout-template.tex")
                             ("Plain" . "plain-template.tex")
                             ("Conference presentation slides" . "conference-presentation-template.tex")
                             ("Lecture slides" . "lecture-template.tex")
                             ("Specify your own template file" . "")))
#+end_src

This is the function which makes a new LaTeX file from one of these templates.
First it asks for one of the keys in the alist =latex-templates=, then, if the =cdr=
of that =cons= cell is empty, prompts for the location of the template. Otherwise,
it uses the value of the =cdr= and concatenates it with the value of
=latex-templates-directory= and asks for a filename/location to copy it to. (The =1=
argument to ~copy-file~ asks for confirmation if the file already exists.)
#+begin_src emacs-lisp
(defun new-latex ()
  "Make a new LaTeX file based on a template. Asks for the template, then for a filename to copy it to."
  (interactive)
  (let* ((template (completing-read "Choose template: " latex-templates-list))
         (template-filename (cdr (assoc template latex-templates-list))))
    (if (string= template-filename"")
        (progn
          (copy-file (read-file-name "Find file: ") (setq new-latex-filename (read-file-name "Enter name for new file: ")) 1)
          (find-file new-latex-filename)
          )
        (progn
          (copy-file (concat latex-templates-directory template-filename) (setq new-latex-filename (read-file-name "Enter name for new file: ")) 1)
          (find-file new-latex-filename)
          )
      )))
#+end_src

