.config/doom/config.org
** Helm-bibtex
Set default =.bib= file.
#+begin_src emacs-lisp
(setq bibtex-completion-bibliography '("~/Dropbox/tex-files/linguistics.bib"))
#+end_src

Keybind to launch =helm-bibtex= -- mapped to =SPC o h=.
#+begin_src emacs-lisp
(map! :leader
      :desc "Helm BibTeX"
      "o h" #'helm-bibtex)
#+end_src

Set cite commands available in =helm-bibtex=.
#+begin_src emacs-lisp
(setq bibtex-completion-cite-commands '("citet" "citep" "citealt" "citealp" "citets" "citealts"))
(setq bibtex-completion-cite-default-command "citet")
#+end_src

Specify where PDFs are to be found. "Bibtex-completion assumes that the name of a PDF consists of the BibTeX key followed plus a user-defined suffix (=.pdf= by default). For example, if a BibTeX entry has the key =Darwin1859=, bibtex-completion searches for =Darwin1859.pdf=." (https://github.com/tmalsburg/helm-bibtex#PDF-files)
#+begin_src emacs-lisp
(setq bibtex-completion-library-path '("~/Dropbox/academic/papers"))
#+end_src

Specify the BibTeX field to use to specify the filename (I don't want to use the default =key.pdf= naming system since I've gotten used to my own way of doing things.).
#+begin_src emacs-lisp
(setq bibtex-completion-pdf-field "pdf")
#+end_src

=helm-bibtex= changed its commands to swap ~Tab~ and ~C-z~ **shrugs**, so I'm changing it back:
#+begin_src emacs-lisp
(map! :after helm
           :map helm-map
           "TAB"      #'helm-select-action
           [tab]      #'helm-select-action
           "C-z"      #'helm-execute-persistent-action)
#+end_src

* Deft
Used just for =org-roam= searching at the moment.

The =deft= directory is the same as my =org-roam= directory.
#+begin_src emacs-lisp
(setq deft-directory "~/Dropbox/org/my-wiki")
#+end_src

We're looking for =org= files, so set the default =deft= extension accordingly:
#+begin_src emacs-lisp
(setq deft-default-extension "org")
#+end_src

There is at least one sub-directory in my =org-roam= directory (the 'daily' directory), so allow =deft= to search recursively:
#+begin_src emacs-lisp
(setq deft-recursive t)
#+end_src

* Org mode
** Set Org locations
Set the Org directory. I keep my Org files on Dropbox for easy access across
devices, including PCs at work, etc.
#+begin_src emacs-lisp
(setq org-directory "~/Dropbox/org/")
#+end_src

I use a single archive file which includes information about what file each
entry comes from.
#+begin_src emacs-lisp
(setq org-archive-location "~/Dropbox/org/archive.org::* From %s")
#+end_src

Set files the agenda should pull from. =gcal= is where Google Calendar entries are
stored (not used at the moment). =master= was my main Org file. =flagged= is where
=org-mobile= entries are stored (also not used). =work= is for professional tasks,
=personal= for personal ones. Also adding some project-specific files, like for
UNLU.

[UPDATE (11/5/22) -- the wrong, fully expanded option was being set in
=custom.el=; no idea why I did that. But it's working happily again now. NOTE:
this didn't use to need the ~after! org~ code, but then the =org-agenda-files= list
started changing to a shorter list with fully expanded '=~=', etc. Possibly after
I installed/configured =org-roam=? Maybe something to look at, but it seems happy
now at any rate ... 15/1/22: had a related problem on Arch -- it set the list to
fully expanded /Windows/ filepaths (i.e. =~= became =c:/Users/Jamie= ...). Simply
evaluating the ~setq~ expression fixed it. And even though the bug originally
happened with the ~after!~ block, removing it didn't help. It now seems happy
again (24/1/22), but I still don't understand the source of the error.]
#+begin_src emacs-lisp
  (setq org-agenda-files (list "~/Dropbox/org/work.org" "~/Dropbox/org/master.org" "~/Dropbox/org/flagged.org" "~/Dropbox/org/personal.org" "~/Dropbox/academic/jobs/oslo-unlu-postdoc/project" "~/Dropbox/org/my-wiki" "~/Dropbox/org/my-wiki/daily"))
#+end_src

** General Org settings
Add inline TODOs. (Removed for now. Not really compatible with how I do things.)
#+begin_src emacs-lisp
;; (require 'org-inlinetask)
#+end_src

Allow shift-select to work in most contexts.
#+begin_src emacs-lisp
(setq org-support-shift-select t)
#+end_src

Change filepath links to always be absolute. (Possible values are =absolute= and
=relative=, with the obvious meanings, along with =noabbrev=, which is like =absolute=
except that it doesn't abbreviate the home directory as =~=, and =adaptive=, which
uses relative paths for files in or below the current directory, and absolute
paths otherwise.)
#+begin_src emacs-lisp
(setq org-link-file-path-type 'absolute)
#+end_src

Setting the default TODO states.
#+begin_src emacs-lisp
(after! org
  (setq org-todo-keywords '((sequence "TODO(t)" "INPROG(i)" "READING(r)" "BLOCKED(b)" "PROJ(p)" "SOMEDAY(s)" "|" "DONE(d)" "CANCELLED(c)"))))
#+end_src

Add some colour to my custom TODO keywords.
#+begin_src emacs-lisp
(after! org
  (setq org-todo-keyword-faces '(("READING" . "#EBCB8B")
                                 ("BLOCKED" . "#D08770")
                                 ("PROJ" . "#9099AB")
                                 ("SOMEDAY" . "#5699AF"))))
#+end_src

Set the levels of priority in org mode. Values below 65 are numerical, while
from 65 upwards they are alphabetic (65=A, 66=B, etc.). I've included a slightly
larger range of priorities: A--D, rather than A--C, and also set the default as
C rather than B. This allows me to have two more-urgent-than-default stages (I'm
using this for reading lists at the moment).
#+begin_src emacs-lisp
  (setq org-priority-highest 65
      org-priority-lowest 68
      org-priority-default 67)
#+end_src

Set the colours of the priority tags (THIS NEEDS PRETTIFYING: at the moment I'm
just stopping D being red like A).
#+begin_src emacs-lisp
(after! org
  (setq org-priority-faces '((65 . error)
                           (66 . warning)
                           (67 . success)
                           (68 . success)))
  )
#+end_src

I've not quite decided whether I like blocked tasks being greyed out or not. At
the moment the only such tasks I have are PROJs.
#+begin_src emacs-lisp
(setq org-agenda-dim-blocked-tasks nil)
#+end_src

Add a timestamp to TODO items when they are changed to DONE.
#+begin_src emacs-lisp
(setq org-log-done 'time)
#+end_src

Use syntax highlighting in source blocks while editing.
#+begin_src emacs-lisp
(setq org-src-fontify-natively t)
#+end_src

Make TAB act as if it were issued in a buffer of the language’s major mode.
#+begin_src emacs-lisp
(setq org-src-tab-acts-natively t)
#+end_src

Have org files start out folded.
#+begin_src emacs-lisp
(after! org
(setq org-startup-folded t)
)
#+end_src

** Prettifying Org mode
Make headlines larger.
#+begin_src emacs-lisp
(custom-set-faces!
  `(org-level-1 :inherit outline-1 :height 1.5)
  `(org-level-2 :inherit outline-2 :height 1.3)
  `(org-level-3 :inherit outline-3 :height 1.15)
  `(org-level-4 :inherit outline-4 :height 1.1)
  `(org-document-title :inherit outline-1 :weight bold :height 2.0 :foreground ,(doom-color 'dark-blue))
)
#+end_src

Hide emphasis markup.
#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t)
#+end_src

Change Org mode to use proportional font by default. (Makes things a bit easier to
read, but not sure it's really good in the long run, so disabled for now.)
#+begin_src emacs-lisp
;; (add-hook 'org-mode-hook 'variable-pitch-mode)
#+end_src

Change the default =...= at the end of a header into an arrow.
#+begin_src emacs-lisp
;; (setq org-ellipsis "⤵")
;; (setq org-ellipsis "▼")
;; (setq org-ellipsis "↴")
#+end_src

** Exporting
*** General
Translate quotes into typographically correct curly quotes (doesn't seem to work with HTML; maybe just PDF via LaTeX?).
#+begin_src emacs-lisp
(setq org-export-with-smart-quotes t)
#+end_src

*** HTML
Don't include the footer with name/publication time etc. at the end of every HTML document.
#+begin_src emacs-lisp
(setq org-html-postamble nil)
#+end_src

*** LaTeX
#+begin_src emacs-lisp
(with-eval-after-load 'ox-latex
(add-to-list 'org-latex-classes
             '("org-plain-latex"
               "\\documentclass{article}
           [NO-DEFAULT-PACKAGES]
           [PACKAGES]
           [EXTRA]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+end_src
** Org-superstar
=org-superstar= helps to prettify Org mode.

Activate =superstar-mode= when =org-mode= is activated.
#+begin_src emacs-lisp
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
#+end_src

Allow special bullets for different TODO keywords.
#+begin_src emacs-lisp
(setq org-superstar-special-todo-items t)
#+end_src

Change TODO items to an open bullet, WAITING to a half full one, DONE to a full one, and CANCELLED to a crossed-through empty bullet.
#+begin_src emacs-lisp
(setq org-superstar-todo-bullet-alist
      '(("TODO" . ?○)
        ("SOMEDAY" . ?○)
        ("READING" . ?○)
        ("INPROG" . ?◐)
        ("DONE" . ?●)
        ("CANCELLED" . ?⦻)
        ))
#+end_src

Change the bullet point shape used for all normal headers.
#+begin_src emacs-lisp
(setq org-superstar-headline-bullets-list '("⁖"))
;; (setq org-superstar-headline-bullets-list '("◉"))
#+end_src

** Custom structure templates
Add a shortcut for including blocks of code to the =org-insert-structure-template=
command (default kbd ~C-c C-,~).

#+begin_src emacs-lisp
(after! org
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("p" . "src python"))
  (add-to-list 'org-structure-template-alist '("u" . "src unlu-rules"))
  )
#+end_src

** Agenda/task management settings
*** Basic settings
Agenda items without a timestamp shouldn't be considered late.
#+begin_src emacs-lisp
(setq org-agenda-sort-notime-is-late nil)
#+end_src

