.config/doom/config.el

(setq bibtex-completion-bibliography '("~/Dropbox/tex-files/linguistics.bib"))

(map! :leader
      :desc "Helm BibTeX"
      "o h" #'helm-bibtex)

(setq bibtex-completion-cite-commands '("citet" "citep" "citealt" "citealp" "citets" "citealts"))
(setq bibtex-completion-cite-default-command "citet")

(setq bibtex-completion-library-path '("~/Dropbox/academic/papers"))

(setq bibtex-completion-pdf-field "pdf")

(map! :after helm
           :map helm-map
           "TAB"      #'helm-select-action
           [tab]      #'helm-select-action
           "C-z"      #'helm-execute-persistent-action)

(setq deft-directory "~/Dropbox/org/my-wiki")

(setq deft-default-extension "org")

(setq deft-recursive t)

(setq org-directory "~/Dropbox/org/")

(setq org-archive-location "~/Dropbox/org/archive.org::* From %s")

(setq org-agenda-files (list "~/Dropbox/org/work.org" "~/Dropbox/org/master.org" "~/Dropbox/org/flagged.org" "~/Dropbox/org/personal.org" "~/Dropbox/academic/jobs/oslo-unlu-postdoc/project" "~/Dropbox/org/my-wiki" "~/Dropbox/org/my-wiki/daily"))

;; (require 'org-inlinetask)

(setq org-support-shift-select t)

(setq org-link-file-path-type 'absolute)

(after! org
  (setq org-todo-keywords '((sequence "TODO(t)" "INPROG(i)" "READING(r)" "BLOCKED(b)" "PROJ(p)" "SOMEDAY(s)" "|" "DONE(d)" "CANCELLED(c)"))))

(after! org
  (setq org-todo-keyword-faces '(("READING" . "#EBCB8B")
                                 ("BLOCKED" . "#D08770")
                                 ("PROJ" . "#9099AB")
                                 ("SOMEDAY" . "#5699AF"))))

(setq org-priority-highest 65
    org-priority-lowest 68
    org-priority-default 67)

(after! org
  (setq org-priority-faces '((65 . error)
                           (66 . warning)
                           (67 . success)
                           (68 . success)))
  )

(setq org-agenda-dim-blocked-tasks nil)

(setq org-log-done 'time)

(setq org-src-fontify-natively t)

(setq org-src-tab-acts-natively t)

(after! org
(setq org-startup-folded t)
)

(custom-set-faces!
  `(org-level-1 :inherit outline-1 :height 1.5)
  `(org-level-2 :inherit outline-2 :height 1.3)
  `(org-level-3 :inherit outline-3 :height 1.15)
  `(org-level-4 :inherit outline-4 :height 1.1)
  `(org-document-title :inherit outline-1 :weight bold :height 2.0 :foreground ,(doom-color 'dark-blue))
)

(setq org-hide-emphasis-markers t)

;; (add-hook 'org-mode-hook 'variable-pitch-mode)

;; (setq org-ellipsis "⤵")
;; (setq org-ellipsis "▼")
;; (setq org-ellipsis "↴")

(setq org-export-with-smart-quotes t)

(setq org-html-postamble nil)

(with-eval-after-load 'ox-latex
(add-to-list 'org-latex-classes
             '("org-plain-latex"
               "\\documentclass{article}
           [NO-DEFAULT-PACKAGES]
           [PACKAGES]
           [EXTRA]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))

(setq org-superstar-special-todo-items t)

(setq org-superstar-todo-bullet-alist
      '(("TODO" . ?○)
        ("SOMEDAY" . ?○)
        ("READING" . ?○)
        ("INPROG" . ?◐)
        ("DONE" . ?●)
        ("CANCELLED" . ?⦻)
        ))

(setq org-superstar-headline-bullets-list '("⁖"))
;; (setq org-superstar-headline-bullets-list '("◉"))

(after! org
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("p" . "src python"))
  (add-to-list 'org-structure-template-alist '("u" . "src unlu-rules"))
  )

(setq org-agenda-sort-notime-is-late nil)
