.config/doom/config.el

(defun print-deadline () "Return an org-mode entry's deadline if it has one" ;;
       (let
           ((deadline (org-get-deadline-time (point))))
         (if deadline
             (concat "(" (org-format-time-string "%d %b '%y" deadline) ")")
           (concat (make-string 5 ?\s) "-"))
         )
       )

(defun org-get-padded-deadline (size)
  "Return string of length SIZE whether it contains a deadline
  timestamp or whichever message is chosen for items without
  deadline"
  (let* ((dl-str (print-deadline))
         (padding (- size (length dl-str))))
    (if (< padding 0) (substring dl-str 0 size)
      (concat dl-str (make-string padding ?\s ))))
  )

(defun org-get-padded-days-to-deadline (size)
  "Return string of length SIZE either containing the days to the
  deadline if there is one, or nothing if not."
  (let* ((deadline (org-get-deadline-time (point)))
         (days-num (org-time-stamp-to-now (org-format-time-string "%Y-%m-%d" deadline)))
         (days-str (if deadline
                       (concat (number-to-string days-num) "d")
                     ""
                     ))
         (padding (- size (length days-str)))
         )
    (if (< padding 0) (substring days-str 0 size)
      (if (< days-num 0)
          (concat days-str (make-string padding ?\s))
          (concat " " days-str (make-string (- padding 1) ?\s))
        ))
    )
  )

(defun get-title (file)
  (let (title)
    (when file
      (with-current-buffer
          (get-file-buffer file)
        (pcase (org-collect-keywords '("TITLE"))
          (`(("TITLE" . ,val))
           (setq title (car val)))))
      title)))

(defun org-get-padded-todo-parent (size)
  "Return string of length SIZE containing either padded or truncated parent name."
  (if (or (equal (file-name-nondirectory buffer-file-name) "personal.org") (equal (file-name-nondirectory buffer-file-name) "work.org"))
      (let* ((parent (car (last(org-get-outline-path))))
             (padding (- size (length parent))))
             (if (<= padding 0) (concat "[" (substring parent 0 (- size 1)) "] " ) (concat "[" parent "]" (make-string padding ?\s ))))
      (let* ((parent (get-title buffer-file-name))
             (padding (- size (length parent))))
        (if (< padding 0) (concat "[" (substring parent 0 (- size 1)) "] ") (concat "[" parent "]" (make-string padding ?\s ))))
      ))

;; (defun org-get-padded-todo-parent (size)
;;   "Return string of length SIZE containing either padded or truncated parent name."
;;   (if (or (equal (file-name-nondirectory buffer-file-name) "personal.org") (equal (file-name-nondirectory buffer-file-name) "work.org"))
;;       (let* ((parent (car (last(org-get-outline-path))))
;;              (padding (- size (length parent))))
;;              (if (< padding 0) (concat "[" (substring parent 0 (- size 1)) "] " ) (concat "[" parent "]" (make-string padding ?\s ))))
;;       (let* ((parent (concat (get-title buffer-file-name) "/" (car (last(org-get-outline-path)))))
;;              (padding (- size (length parent))))
;;         (if (< padding 0) (concat "[" (substring parent 0 (- size 1)) "] ") (concat "[" parent "]" (make-string padding ?\s ))))
;;       ))

;; (defun org-get-padded-todo-parent (size)
;;   "Return string of length SIZE containing either padded or truncated parent name."
;;   (cond ((equal (file-name-nondirectory buffer-file-name) "private.org")
;;                 (let* ((parent (concat "Personal/" (car (last(org-get-outline-path)))))
;;                        (padding (- size (length parent))))
;;                        (if (< padding 0) (concat "[" (substring parent 0 (- size 1)) "] " ) (concat "[" parent "]" (make-string padding ?\s )))))
;;         ((equal (file-name-nondirectory buffer-file-name) "work.org")
;;                 (let* ((parent (concat "Work/" (car (last(org-get-outline-path)))))
;;                        (padding (- size (length parent))))
;;                        (if (< padding 0) (concat "[" (substring parent 0 (- size 1)) "] " ) (concat "[" parent "]" (make-string padding ?\s )))))
;;         (t (let* ((parent (concat (get-title buffer-file-name) "/" (car (last(org-get-outline-path)))))
;;                   (padding (- size (length parent))))
;;                   (if (< padding 0) (concat "[" (substring parent 0 (- size 1)) "] ") (concat "[" parent "]" (make-string padding ?\s )))))
;;   )
;; )

(defun org-deadline-cmp (a b)
  "Compares the deadlines of two org agenda items, a and b,
and returns -1 if a is before b, or +1 if a is after b"
    (let* (
           (default (if org-agenda-sort-notime-is-late -1 most-positive-fixnum))
           (a-pos (get-text-property 0 'org-marker a))
           (b-pos (get-text-property 0 'org-marker b))
           (a-string (org-entry-get a-pos "DEADLINE"))
           (b-string (org-entry-get b-pos "DEADLINE"))
           (a-num (if a-string (org-2ft a-string) default))
           (b-num (if b-string (org-2ft b-string) default))
           )
          (cond ((< a-num b-num) -1)
          ((< b-num a-num) +1))
        ))
