.config/doom/config.org
*** Custom agenda views
The 'prefix' for TODO lists determines what gets displayed before the actual
TODO item. I like to show the days until the deadline, the actual deadline, and
what the parent of the TODO item is. (This uses the functions defined in the
previous section.)
#+begin_src emacs-lisp
(defun org-agenda-todo-custom-prefix ()
  "Custom prefix for my TODO list view in the agenda"
  (concat (org-get-padded-days-to-deadline 6) (org-get-padded-deadline 14)  (org-get-padded-todo-parent 18))
  )
#+end_src

This function (from [[https:lists.gnu.org/archive/html/emacs-orgmode/2015-06/msg00266.html][here]]) hides agenda blocks with no entries.
#+begin_src emacs-lisp
 (defun org-agenda-delete-empty-blocks ()
  "Remove empty agenda blocks.
  A block is identified as empty if there are fewer than 2
  non-empty lines in the block (excluding the line with
  `org-agenda-block-separator' characters)."
  (when org-agenda-compact-blocks
    (user-error "Cannot delete empty compact blocks"))
  (setq buffer-read-only nil)
  (save-excursion
    (goto-char (point-min))
    (let* ((blank-line-re "^\\s-*$")
           (content-line-count (if (looking-at-p blank-line-re) 0 1))
           (start-pos (point))
           (block-re (format "%c\\{10,\\}" org-agenda-block-separator)))
      (while (and (not (eobp)) (forward-line))
        (cond
         ((looking-at-p block-re)
          (when (< content-line-count 2)
            (delete-region start-pos (1+ (point-at-bol))))
          (setq start-pos (point))
          (forward-line)
          (setq content-line-count (if (looking-at-p blank-line-re) 0 1)))
         ((not (looking-at-p blank-line-re))
          (setq content-line-count (1+ content-line-count)))))
      (when (< content-line-count 2)
        (delete-region start-pos (point-max)))
      (goto-char (point-min))
      ;; The above strategy can leave a separator line at the beginning
      ;; of the buffer.
      (when (looking-at-p block-re)
        (delete-region (point) (1+ (point-at-eol))))))
  (setq buffer-read-only t))
#+end_src

We then add it to the =org-agenda-finalize-hook=.
#+begin_src emacs-lisp
(add-hook 'org-agenda-finalize-hook #'org-agenda-delete-empty-blocks)
#+end_src

Use my own deadline sorting function as the user-defined one.
#+begin_src emacs-lisp
(setq org-agenda-cmp-user-defined 'org-deadline-cmp)
#+end_src

My own agenda view, which makes use of the custom prefix and splits up the TODOs
into different blocks. I need to work out what I want from the agenda proper, so
for now I've left it out. I also have a 'test view' that I use for
experimenting. TODOs are sorted with the most pressing at the top.
#+begin_src emacs-lisp
(setq org-agenda-custom-commands
        '(("c" "My agenda view"
           (
            (todo "TODO|INPROG" (
                         (org-agenda-overriding-header "Uncategorised TODOs")
                         (org-agenda-files '("~/Dropbox/org/my-wiki/daily"))
                         (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
                         ;;(org-agenda-cmp-user-defined 'org-deadline-cmp-3)
                         (org-agenda-sorting-strategy '((todo user-defined-up)))
                         )
                  )
            (todo "BLOCKED" (
                         (org-agenda-overriding-header "Blocked uncategorised TODOs")
                         (org-agenda-files '("~/Dropbox/org/my-wiki/daily"))
                         (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
                         (org-agenda-sorting-strategy '((todo user-defined-up)))
                         )
                     )
            (todo "TODO|INPROG" (
                         (org-agenda-overriding-header "Personal TODOs")
                         (org-agenda-files '("~/Dropbox/org/personal.org"))
                         (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
                         ;;(org-agenda-cmp-user-defined 'org-deadline-cmp-3)
                         (org-agenda-sorting-strategy '((todo user-defined-up)))
                         )
                  )
            (todo "BLOCKED" (
                         (org-agenda-overriding-header "Blocked personal TODOs")
                         (org-agenda-files '("~/Dropbox/org/personal.org"))
                         (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
                         (org-agenda-sorting-strategy '((todo user-defined-up)))
                         )
                     )
            (todo "TODO|INPROG" (
                         (org-agenda-overriding-header "Professional TODOs")
                         ;; Using a regexp to match things I don't want in my professional TODOs: in this case, the dir my-wiki, along with the subdir daily, and my personal.org file.
                         ;; I don't just specify work.org explicitly, as I want to allow other project files to be included.
                         (org-agenda-files (cl-remove-if (lambda (x) (string-match "\\(?:my-wiki\\(?:/daily\\)?\\|personal\\.org\\)" x)) org-agenda-files))
                         (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
                         ;;(org-agenda-cmp-user-defined 'org-deadline-cmp-3)
                         (org-agenda-sorting-strategy '((todo user-defined-up)))
                         )
                  )
            (todo "BLOCKED" (
                         (org-agenda-overriding-header "Blocked professional TODOs")
                         ;; Using a regexp to match things I don't want in my professional TODOs: in this case, the dir my-wiki, along with the subdir daily, and my personal.org file.
                         ;; I don't just specify work.org explicitly, as I want to allow other project files to be included.
                         (org-agenda-files (cl-remove-if (lambda (x) (string-match "\\(?:my-wiki\\(?:/daily\\)?\\|personal\\.org\\)" x)) org-agenda-files))
                         (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
                         (org-agenda-sorting-strategy '((todo user-defined-up)))
                         )
                     )
            ;; (todo "TODO|INPROG" (
            ;;              (org-agenda-overriding-header "Wiki TODOs")
            ;;              (org-agenda-files '("~/Dropbox/org/my-wiki"))
            ;;              (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
            ;;              ;;(org-agenda-cmp-user-defined 'org-deadline-cmp-3)
            ;;              (org-agenda-sorting-strategy '((todo user-defined-up)))
            ;;              )
            ;;       )
            (todo "BLOCKED" (
                         (org-agenda-overriding-header "Blocked wiki TODOs")
                         (org-agenda-files '("~/Dropbox/org/my-wiki"))
                         (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
                         (org-agenda-sorting-strategy '((todo user-defined-up)))
                         )
                     )
            (todo "PROJ" (
                         (org-agenda-overriding-header "Ongoing projects")
                         (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
                         (org-agenda-sorting-strategy '((todo user-defined-up)))
                         )
                     )
            (tags "PRIORITY=\"A\"+TODO=\"READING\"|PRIORITY=\"B\"+TODO=\"READING\"" (
                         (org-agenda-overriding-header "Priority reading list")
                         (org-agenda-prefix-format '((tags . "%(org-agenda-todo-custom-prefix)")))
                         (org-agenda-sorting-strategy '((tags user-defined-up priority-down)))
                         )
                  )
            (todo "SOMEDAY" (
                             (org-agenda-overriding-header "Things to get round to some day ...")
                             (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
                             (org-agenda-sorting-strategy '((todo user-defined-up)))
                             )
                     )
            ;; (agenda "")
            )
           )
          ("r" "Reading lists"
           (
            (todo "READING" (
                             (org-agenda-prefix-format '((todo . "%(org-agenda-todo-custom-prefix)")))
                             (org-agenda-sorting-strategy '((todo user-defined-up priority-down)))
                             )
                  )
            )
           )
          ("w" "This week"
           ((tags-todo "this_week" (
                         (org-agenda-overriding-header "To do this week")
                         (org-agenda-prefix-format "%(org-agenda-todo-custom-prefix)")
                         (org-agenda-sorting-strategy '((user-defined-up priority-down)))
                        )
                     )
            )
          )
        ;;   ("R" "Test view"
        ;;    ((alltodo "" (
        ;;                  (org-agenda-prefix-format '((todo . "%(org-agenda-custom-prefix)")))
        ;;                  (org-agenda-cmp-user-defined 'deadline-sort)
        ;;                  (org-agenda-sorting-strategy '((todo user-defined-up)))
        ;;                 )
        ;;              )
        ;;     )
        ;;   )
        )
  )
  #+end_src

