.config/doom/config.el

(defun org-ask-location ()
    (let* ((org-refile-targets '((nil :maxlevel . 9)))
           (hd (car (cdr (cdr (org-refile-get-location "Headline" nil t)))))
           )
      (goto-char (point-min))
      (re-search-forward hd nil nil)
      )
    (end-of-line))

(after! org
  (setq org-capture-templates
        '(
          ("p" "Personal TODO item" entry (file+headline "personal.org" "To-do list")
           "* TODO %?")
          ;;
          ("w" "Work TODO item" entry (file+headline "work.org" "To-do list")
           "* TODO %?")
          ;;
          ("r" "READING item" entry (file+headline "work.org" "Reading list")
           "* READING %?")
          ))
  )

(setq org-roam-directory "~/Dropbox/org/my-wiki")

(define-generic-mode
   'unlu-rules-mode                          ;; name of the mode to create
   '("# " "##")                              ;; comments start with '#'
   '("relation" "coarsePos"
     "lemma")                                ;; some keywords
   '(
     ("![\\{)a-z ]" . font-lock-variable-name-face)
     ("\\^" . font-lock-variable-name-face)
     ("=" . font-lock-builtin-face)
     ("->" . font-lock-builtin-face)
     (";" . font-lock-builtin-face)
     ("-o" . font-lock-builtin-face)
     ("+" . font-lock-builtin-face)
     (":" . font-lock-builtin-face)
     ("~" . font-lock-negation-char-face)
     ;; ("\\\\[a-zA-Z]" . font-lock-constant-face)
     ("#[1-9]" . font-lock-type-face)
     )                                       ;; extra highlights
   '("\\.dat$")                              ;; files for which to activate this mode
   '(rainbow-delimiters-mode)                ;; other functions to call
   "A mode for the UNLU project rule file"   ;; doc string for this mode
 )
